Topic : 1 Creating dataframe 
        2.Dealing with rows and columns
        3.Operations :min,max,std,describe
        4.Conditional selection
        5.set_index

In [1]:
import pandas as pd
df=pd.read_csv("weather_data2.csv")
df

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  01-02-2017           35          7  Sunny
2  01-03-2017           28          2   Snow
3  01-04-2017           24          7   Snow
4  01-05-2017           32          4   Rain
5  01-06-2017           31          2  Sunny

In [2]:
df.head() #takes automatically 1st five

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  01-02-2017           35          7  Sunny
2  01-03-2017           28          2   Snow
3  01-04-2017           24          7   Snow
4  01-05-2017           32          4   Rain

In [3]:
df.head(3)

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  01-02-2017           35          7  Sunny
2  01-03-2017           28          2   Snow

In [4]:
df.tail() ##takes automatically last five

          day  temperature  windspeed  event
1  01-02-2017           35          7  Sunny
2  01-03-2017           28          2   Snow
3  01-04-2017           24          7   Snow
4  01-05-2017           32          4   Rain
5  01-06-2017           31          2  Sunny

In [5]:
df.shape #for no. of rows and columns

(6, 4)

In [6]:
rows , columns=df.shape

In [7]:
rows

6

In [8]:
columns

4

In [9]:
#slicing

df[2:5]

          day  temperature  windspeed event
2  01-03-2017           28          2  Snow
3  01-04-2017           24          7  Snow
4  01-05-2017           32          4  Rain

In [10]:
df.columns #to print headings of columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [11]:
df.day #to print data in day column

0    01-01-2017
1    01-02-2017
2    01-03-2017
3    01-04-2017
4    01-05-2017
5    01-06-2017
Name: day, dtype: object

In [12]:
df[['event','day']] #to print only particular columns

   event         day
0   Rain  01-01-2017
1  Sunny  01-02-2017
2   Snow  01-03-2017
3   Snow  01-04-2017
4   Rain  01-05-2017
5  Sunny  01-06-2017

In [13]:
df['temperature'].max #to print max to min

<bound method NDFrame._add_numeric_operations.<locals>.max of 0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64>

In [14]:
df['temperature'].max ()#to print max value

35

In [15]:
df['windspeed'].mean #to print max to min

<bound method NDFrame._add_numeric_operations.<locals>.mean of 0    6
1    7
2    2
3    7
4    4
5    2
Name: windspeed, dtype: int64>

In [16]:
df['windspeed'].mean()

4.666666666666667

In [17]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [18]:
df[df['temperature']==df['temperature'].max ()] #like df['temperature'] we given a condition inside df

          day  temperature  windspeed  event
1  01-02-2017           35          7  Sunny

In [19]:
df[['day','temperature']]

          day  temperature
0  01-01-2017           32
1  01-02-2017           35
2  01-03-2017           28
3  01-04-2017           24
4  01-05-2017           32
5  01-06-2017           31

In [20]:
df[['day','temperature']][df['temperature']==df['temperature'].max ()]

          day  temperature
1  01-02-2017           35

In [21]:
df.index #setting index

RangeIndex(start=0, stop=6, step=1)

In [22]:
df.set_index('day',inplace=True)

In [23]:
df

            temperature  windspeed  event
day
01-01-2017           32          6   Rain
01-02-2017           35          7  Sunny
01-03-2017           28          2   Snow
01-04-2017           24          7   Snow
01-05-2017           32          4   Rain
01-06-2017           31          2  Sunny

In [24]:
df.loc['01-03-2017'] #to get particular information of an row

temperature      28
windspeed         2
event          Snow
Name: 01-03-2017, dtype: object

In [25]:
#reset index
df.reset_index(inplace=True)

In [26]:
df

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  01-02-2017           35          7  Sunny
2  01-03-2017           28          2   Snow
3  01-04-2017           24          7   Snow
4  01-05-2017           32          4   Rain
5  01-06-2017           31          2  Sunny